обычно канальный уровень разбивает поток битов на отдельные кадры и вычисляет для каждого ядра короткий маркер называемый
контрольной суммой
контрольная сумма - короткий маркер для отдельного кадра
символьное заполнение byte stuffing
PPP - point to point protocol
PPP - point to point protocol
PPP - point to point prototcl
PPP - point to point protocol
PPP - point to point protocol

битовое заполнение bit stuffing
битовое заполнение применяется в протоколе USB - UNIVERSAL SERIAL BUS - универсальная последовательная шина

эти три управляющих поля вместе называются заголовком кадра frame header
frame header frame header frame header frame header frame header frame ehader frmae header frame header frame header

таким образом сетевой уровень может действовать так как будто машины обмениваются пакетами напрямую
процедуры from_physical_layer and to_physycal_layer используются для обмена кадрами между канальными и физическими уровнями

протоколы в которых отправитель посылает один кадр после чего ожидает подтверждения называются протоколами с ожиданием stop-and-wait

кадры могут либо портитсья либо теряться
Если кадр будет поврежден таким образом что контрольная сумма совпадает что бывает крайне редко
то этот протокол передаст неверный пакет

возникаее вопрос, каково минимальное количество бит, достаточное для порядкового номера кадров?
один бит - одна неопределенность
piggybacking

geo - спутники на геостационарной орбите
